In [6]:
import pandas as pd

In [7]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [8]:
list('321')

['3', '2', '1']

In [9]:
df = pd.DataFrame(data, list('321'), list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [10]:
df.sort_index(inplace = True)

In [11]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [12]:
df.sort_index(inplace = True, axis = 1)

In [13]:
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [17]:
df.sort_values(by = ['X', 'Y'], inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [16]:
df.sort_values(by = '3', axis = 1, inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

## EXERCICIOS

In [19]:
data = [[9, 6, 3], [8, 5, 2], [7, 4, 1]]
data

[[9, 6, 3], [8, 5, 2], [7, 4, 1]]

In [20]:
list('321')

['3', '2', '1']

In [21]:
df = pd.DataFrame(data, list('321'), list('CBA'))
df

   C  B  A
3  9  6  3
2  8  5  2
1  7  4  1

In [22]:
df.sort_index()
df.sort_index(axis = 1)
df

   C  B  A
3  9  6  3
2  8  5  2
1  7  4  1